RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_syslib.h
/*******************************************************************************
* Macro Name: CY_ARRAY_SIZE(x)
****************************************************************************//**
*
* Returns the size of Array
*
* \param x  Array Name
*
* \note
* This macro is available for devices having M33SYSCPUSS IP.
*
*******************************************************************************/
#define CY_ARRAY_SIZE(x) (sizeof(x) / sizeof((x)[0]))
#endif /* CY_IP_M33SYSCPUSS */


/******************************************************************************
* Constants
*****************************************************************************/
/** Defines a 32-kHz clock delay */
#define CY_DELAY_MS_OVERFLOW            (0x8000U)

/**
* \defgroup group_syslib_macros_reset_cause Reset cause
* \{
* Define RESET_CAUSE mask values
*/
/** A basic WatchDog Timer (WDT) reset has occurred since the last power cycle. */
#define CY_SYSLIB_RESET_HWWDT           (0x0001U)
/** The fault logging system requested a reset from its Active logic. */
#define CY_SYSLIB_RESET_ACT_FAULT       (0x0002U)
/** The fault logging system requested a reset from its Deep-Sleep logic. */
#define CY_SYSLIB_RESET_DPSLP_FAULT     (0x0004U)

#if defined (CY_IP_M33SYSCPUSS) || defined (CY_IP_M7CPUSS)
/** The fault logging system requested a reset from its Test Controller or debugger asserted test. */
/**
* \note
* This macro is available for devices having M33SYSCPUSS IP.
**/
#define CY_SYSLIB_RESET_TC_DBGRESET     (0x0008U)
#endif

/** The CPU requested a system reset through it's SYSRESETREQ. This can be done via a debugger probe or in firmware. */
#define CY_SYSLIB_RESET_SOFT            (0x0010U)
/** The Multi-Counter Watchdog timer #0 reset has occurred since the last power cycle. */
#define CY_SYSLIB_RESET_SWWDT0          (0x0020U)
/** The Multi-Counter Watchdog timer #1 reset has occurred since the last power cycle. */
#define CY_SYSLIB_RESET_SWWDT1          (0x0040U)
/** The Multi-Counter Watchdog timer #2 reset has occurred since the last power cycle. */
#define CY_SYSLIB_RESET_SWWDT2          (0x0080U)
/** The Multi-Counter Watchdog timer #3 reset has occurred since the last power cycle. */
#define CY_SYSLIB_RESET_SWWDT3          (0x0100U)
/** The reset has occurred on a loss of high-frequency clock. */
#define CY_SYSLIB_RESET_CSV_LOSS_WAKEUP      (0x10000UL)
/** The reset has occurred due to frequency error of high-frequency clock. */
#define CY_SYSLIB_RESET_CSV_ERROR_WAKEUP      (0x20000UL)
/** The reset has occurred on a wakeup from Hibernate power mode. */
#define CY_SYSLIB_RESET_HIB_WAKEUP      (0x40000UL)

#ifdef CY_IP_M7CPUSS
/**
* \note
* Below macro are available for devices having CY_IP_M7CPUSS IP.
**/
/** External XRES pin was asserted. This is a high-voltage cause bit that blocks recording of other high-voltage cause bits, except RESET_PORVDDD. */
#define CY_SYSLIB_RESET_XRES             (0x10000U)
/** External VDDD supply crossed brown-out limit.  Note that this cause will only be observable as long as the VDDD supply does not go below the POR (power on reset) detection limit. */
#define CY_SYSLIB_RESET_BODVDDD          (0x20000)
/** External VDDA supply crossed the brown-out limit.  This is a high-voltage cause bit that blocks recording of other high-voltage cause bits, except RESET_PORVDDD. */
#define CY_SYSLIB_RESET_BODVDDA          (0x40000)
/** Internal VCCD core supply crossed the brown-out limit.  Note that this detector will detect gross issues with the internal core supply, but may not catch all brown-out conditions. */
#define CY_SYSLIB_RESET_BODVCCD          (0x80000)
/** Overvoltage detection on the external VDDD supply.  This is a high-voltage cause bit that blocks recording of other high-voltage cause bits, except RESET_PORVDDD. */
#define CY_SYSLIB_RESET_OVDVDDD          (0x100000)
/** Overvoltage detection on the external VDDA supply.  This is a high-voltage cause bit that blocks recording of other high-voltage cause bits, except RESET_PORVDDD. */
#define CY_SYSLIB_RESET_OVDVDDA          (0x200000)
/** Overvoltage detection on the internal core VCCD supply.  This is a high-voltage cause bit that blocks recording of other high-voltage cause bits, except RESET_PORVDDD. */
#define CY_SYSLIB_RESET_OVDVCCD          (0x400000)
/** Overcurrent detection on the internal VCCD supply when supplied by the ACTIVE power mode linear regulator. This is a high-voltage cause bit that blocks recording of other high-voltage cause bits, except RESET_PORVDDD.  */
#define CY_SYSLIB_RESET_OCD_ACT_LINREG   (0x800000)
/** Overcurrent detection on the internal VCCD supply when supplied by the DEEPSLEEP power mode linear regulator. This is a high-voltage cause bit that blocks recording of other high-voltage cause bits, except RESET_PORVDDD. */
#define CY_SYSLIB_RESET_OCD_DPSLP_LINREG (0x1000000)
/** Overcurrent detection from REGHC (if present).  If REGHC is not present, hardware will never set this bit.This is a high-voltage cause bit that blocks recording of other high-voltage cause bits, except RESET_PORVDDD. */
#define CY_SYSLIB_RESET_OCD_REGHC        (0x2000000)
/** PMIC status triggered a reset.  If PMIC control is not present, hardware will never set this bit. This is a high-voltage cause bit that blocks recording of other high-voltage cause bits, except RESET_PORVDDD. */
#define CY_SYSLIB_RESET_PMIC             (0x4000000)
/** PXRES triggered.  This is a high-voltage cause bit that blocks recording of other high-voltage cause bits, except RESET_PORVDDD. Hardware clears this bit during POR. */
#define CY_SYSLIB_RESET_PXRES            (0x10000000)
/** Structural reset was asserted.  This is a high-voltage cause bit that blocks recording of other high-voltage cause bits, except RESET_PORVDDD. Hardware clears this bit during POR. */
#define CY_SYSLIB_RESET_STRUCT_XRES      (0x20000000)
/** Indicator that a POR occurred.  This is a high-voltage cause bit, and hardware clears the other bits when this one is set. It does not block further recording of other high-voltage causes. */
#define CY_SYSLIB_RESET_PORVDDD          (0x40000000)

#endif


/** \} group_syslib_macros_reset_cause */

#ifdef CY_IP_M4CPUSS
/** Bit[31:24] Opcode = 0x1B (SoftReset)
 *  Bit[7:1]   Type   = 1    (Only CM4 reset)
 */
/**
* \note
* This macro is available for devices having M4CPUSS IP.
**/
#define CY_IPC_DATA_FOR_CM4_SOFT_RESET  (0x1B000002UL)

/**
* \defgroup group_syslib_macros_unique_id Unique ID
* \{
* Unique ID fields positions
*/
/**
* \note
* This macro is available for devices having M4CPUSS IP.
**/
#define CY_UNIQUE_ID_DIE_YEAR_Pos       (57U)    /**< The position of the DIE_YEAR  field in the silicon Unique ID */
/**
* \note
* This macro is available for devices having M4CPUSS IP.
**/
#define CY_UNIQUE_ID_DIE_MINOR_Pos      (56U)    /**< The position of the DIE_MINOR field in the silicon Unique ID */
/**
* \note
* This macro is available for devices having M4CPUSS IP.
**/
#define CY_UNIQUE_ID_DIE_SORT_Pos       (48U)    /**< The position of the DIE_SORT  field in the silicon Unique ID */
/**
* \note
* This macro is available for devices having M4CPUSS IP.
**/
#define CY_UNIQUE_ID_DIE_Y_Pos          (40U)    /**< The position of the DIE_Y     field in the silicon Unique ID */
/**
* \note
* This macro is available for devices having M4CPUSS IP.
**/
#define CY_UNIQUE_ID_DIE_X_Pos          (32U)    /**< The position of the DIE_X     field in the silicon Unique ID */
/**
* \note
* This macro is available for devices having M4CPUSS IP.
**/
#define CY_UNIQUE_ID_DIE_WAFER_Pos      (24U)    /**< The position of the DIE_WAFER field in the silicon Unique ID */
/**
* \note
* This macro is available for devices having M4CPUSS IP.
**/
#define CY_UNIQUE_ID_DIE_LOT_2_Pos      (16U)    /**< The position of the DIE_LOT_2 field in the silicon Unique ID */
/**
* \note
* This macro is available for devices having M4CPUSS IP.
**/
#define CY_UNIQUE_ID_DIE_LOT_1_Pos      (8U)     /**< The position of the DIE_LOT_1 field in the silicon Unique ID */
/**
* \note
* This macro is available for devices having M4CPUSS IP.
**/
#define CY_UNIQUE_ID_DIE_LOT_0_Pos      (0U)     /**< The position of the DIE_LOT_0 field in the silicon Unique ID */

/** \} group_syslib_macros_unique_id */
#endif

/** \} group_syslib_macros */

