RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_syslib.h
/******************************************************************************
* Function prototypes
******************************************************************************/

/**
* \addtogroup group_syslib_functions
* \{
*/

/*******************************************************************************
* Function Name: Cy_SysLib_Delay
****************************************************************************//**
*
* The function delays by the specified number of milliseconds.
* By default, the number of cycles to delay is calculated based on the
* \ref SystemCoreClock.
*
* \param milliseconds  The number of milliseconds to delay.
*
* \note The function calls \ref Cy_SysLib_DelayCycles() API to generate a delay.
*       If the function parameter (milliseconds) is bigger than
*       CY_DELAY_MS_OVERFLOW constant, then an additional loop runs to prevent
*       an overflow in parameter passed to \ref Cy_SysLib_DelayCycles() API.
*
* \note The Calibration factor is to correct the delay in cases where
*       CPU's use branch prediction, currently applicable for only CAT1C
*       devices.
*
*******************************************************************************/
void Cy_SysLib_Delay(uint32_t milliseconds);


/*******************************************************************************
* Function Name: Cy_SysLib_DelayUs
****************************************************************************//**
*
* The function delays by the specified number of microseconds.
* By default, the number of cycles to delay is calculated based on the
* \ref SystemCoreClock.
*
* \param microseconds  The number of microseconds to delay.
*
* \note If the CPU frequency is a small non-integer number, the actual delay
*       can be up to twice as long as the nominal value. The actual delay
*       cannot be shorter than the nominal one.
*
* \note The Calibration factor is to correct the delay in cases where
*       CPU's use branch prediction, currently applicable for only CAT1C
*       devices.
*
*******************************************************************************/
void Cy_SysLib_DelayUs(uint16_t microseconds);

/*******************************************************************************
* Function Name: Cy_SysLib_Rtos_Delay
****************************************************************************//**
*
* The function is same as \ref Cy_SysLib_Delay. However, this API is declared WEAK
* providing option for user to overwrite the implementation based on target RTOS.
*
* \param milliseconds  The number of milliseconds to delay.
*
*******************************************************************************/
void Cy_SysLib_Rtos_Delay(uint32_t milliseconds);


/*******************************************************************************
* Function Name: Cy_SysLib_Rtos_DelayUs
****************************************************************************//**
*
* The function is same as \ref Cy_SysLib_DelayUs. However, this API is declared WEAK
* providing option for user to overwrite the imlementation based on target RTOS.
*
* \param microseconds  The number of microseconds to delay.
*
*******************************************************************************/
void Cy_SysLib_Rtos_DelayUs(uint16_t microseconds);


/** Delays for the specified number of cycles.
 *  The function is implemented in the assembler for each supported compiler.
 *  \param cycles  The number of cycles to delay.
 */
void Cy_SysLib_DelayCycles(uint32_t cycles);


/*******************************************************************************
* Function Name: Cy_SysLib_Halt
****************************************************************************//**
*
* This function halts the CPU but only the CPU which calls the function.
* It doesn't affect other CPUs.
*
* \param reason  The value to be used during debugging.
*
* \note The function executes the BKPT instruction for halting CPU and is
*       intended to be used for the debug purpose. A regular use case requires
*       Debugger attachment before the function call.
*       The BKPT instruction causes the CPU to enter the Debug state. Debug
*       tools can use this to investigate the system state, when the
*       instruction at a particular address is reached.
*
* \note Execution of a BKPT instruction without a debugger attached produces
*       a fault. The fault results in the HardFault exception being taken
*       or causes a Lockup state if it occurs in the NMI or HardFault handler.
*       The default HardFault handler make a software reset if the build option
*       is the release mode (NDEBUG). If the build option is the debug mode,
*       the system will stay in the infinite loop of the
*       \ref Cy_SysLib_ProcessingFault() function.
*
*******************************************************************************/
#ifdef CY_IP_M4CPUSS
/** \cond INTERNAL */
__NO_RETURN void Cy_SysLib_Halt(uint32_t reason);
/** \endcond */
#endif
#if defined (CY_IP_M33SYSCPUSS) || defined (CY_IP_M55APPCPUSS) || defined (CY_DOXYGEN)
    void Cy_SysLib_Halt(uint32_t reason);
#endif


/*******************************************************************************
* Macro Name: Cy_SysLib_AssertFailed
****************************************************************************//**
*
* This function stores the ASSERT location of the file name (including path
* to file) and line number in a non-zero init area for debugging. Also it calls
* the \ref Cy_SysLib_Halt() function to halt the processor.
*
* \param file  The file name of the ASSERT location.
* \param line  The line number of the ASSERT location.
*
* \note A stored file name and line number could be accessed by
*       cy_assertFileName and cy_assertLine global variables.
* \note This function has the WEAK option, so the user can redefine
*       the function for a custom processing.
*
*******************************************************************************/
void Cy_SysLib_AssertFailed(const char_t * file, uint32_t line);

#ifdef CY_IP_M4CPUSS


